quadratic_equation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-30 Tue 18:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solving Quadratic Equations</title>
<meta name="author" content="Rawley Amankwah" />
<meta name="generator" content="Org Mode" />



</head>
<body>
<div id="content" class="content">
<h1 class="title">Solving Quadratic Equations</h1>
<p>
"We do not learn mathematics, we just get used to it" - Amankwah Rawley
</p>

<p>
A Quadratic Equation is a polynomial equation of the form \(ax^2 + bx + c = 0\) (A polynomial of order 2). There are several ways to solve quadratic equations. This
article will elaborate on <b><b>three</b></b> methods. They are:
</p>
<ul class="org-ul">
<li>Factorization</li>
<li>Completing of Squares</li>
<li>Quadratic Formula</li>
</ul>


<div id="outline-container-orgc5e4ab5" class="outline-2">
<h2 id="orgc5e4ab5"><span class="section-number-2">1.</span> Factorization</h2>
<div class="outline-text-2" id="text-1">
<p>
Given a quadratic equation \(ax^2 + bx + c = 0\). The factorization method says
</p>
<ul class="org-ul">
<li>Find the factors of c (including negative values).</li>
<li>Find two factors of c such that they multiply to give c and sum to give b.</li>
<li>Substitute the two factors for b</li>
<li>Group the terms in Twos</li>
<li>Then Factorize</li>
</ul>
</div>

<div id="outline-container-orgaf0258b" class="outline-3">
<h3 id="orgaf0258b"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Consider the following quadratic equation: \(x^2 + 5x + 6 = 0\)
Firstly we recognize that \(a=1, b=5, c=6\)
Using the Factorization method
</p>
<ul class="org-ul">
<li>Find the factors of the c=6</li>
</ul>
<p>
(Factors simply means integers which can divide c exactly without a remainder)
The factors of c are \({-3,-2,-1,1,2,3,6}\)
</p>

<ul class="org-ul">
<li>Finding two factors of c such that they multiply to give c=6 and sum to give b=5</li>
</ul>
<p>
Intuitively, we recognize the satisfying factors are \({3,2}\) because \(3\times 2 = 6\) and \(3+2 = 5\)
</p>

<ul class="org-ul">
<li>Substituting the two factors for b</li>
</ul>
<p>
\(x^2 + 5x + 6 = 0\) <br />
\(x^2 + 3x + 2x + 6 = 0\) <br />
\((x^2 + 3x) + (2x + 6) = 0\) <br />
</p>

<ul class="org-ul">
<li>Then Factorizing</li>
</ul>
<p>
We recognize that the first group has coefficients \({1,3}\) and the second group \({2,6}\) <br />
For each group we find the greatest common divisor: <br />
The greatest common divisor or (Highest common divisor (HCF)) for the first group is \(1\) and the second group is \(2\) <br />
\(1x(x + 3) + 2(x + 3) = 0\) <br />
Whenever one uses the factorization method, one has to get similar values in both brackets at this point, else <br />
it means, there was an error <br />
We group the values outside the brackets into one bracket, and we pick one of the duplicate brackets \((x+3)\) <br />
\((x+2)(x+3) = 0\) <br />
To find the solution, we simply equate each bracket to 0 <br />
\(x+2 = 0\) <br />
\(x=-2\) <br />
or <br />
\(x+3 = 0\) <br />
\(x=-3\) <br />
</p>
</div>
</div>

<div id="outline-container-org48e6dfd" class="outline-3">
<h3 id="org48e6dfd"><span class="section-number-3">1.2.</span> Example 2</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Consider the following quadratic equation: \(x^2 -5x + 6 = 0\) <br />
<b><b>Note</b></b> This example is different from the above example because: <br />
Firstly we recognize that \(a=1, b=-5, c=6\) <br />
<b><b>Note</b></b> b is -5 instead <br />
Using the Factorization method: <br />
</p>
<ul class="org-ul">
<li>Find the factors of the c=6</li>
</ul>
<p>
The factors of c are \({-3,-2,-1,1,2,3,6}\) <br />
</p>

<ul class="org-ul">
<li>Finding two factors of c such that they multiply to give c=6 and sum to give b=-5</li>
</ul>
<p>
Intuitively, we recognize the satisfying factors are \({-3,-2}\) because \(-3\times -2=6\) and \(-3+(-2)=-5\) <br />
</p>

<ul class="org-ul">
<li>Substituting the two factors for b</li>
</ul>
<p>
\(x^2 -5x + 6 = 0\) <br />
\(x^2 - 3x + -2x + 6 = 0\) <br />
\((x^2 - 3x) + (-2x + 6) = 0\) <br />
Factorizing by finding the HCF or greatest common divisor <br />
\(x(x - 3) + -2(x - 3) = 0\) <br />
We are happy, because the two brackets are the same. <br />
We group the values outside of the brackets into a bracket and pick one of the duplicated bracket <br />
\((x - 2)(x-3) = 0\) <br />
To find the solution (roots), we equate the each bracket to 0 <br />
\(x - 2 = 0\) <br />
\(x = 2\) <br />
or <br />
\(x - 3 = 0\) <br />
\(x = 3\) <br />
</p>
</div>

<div id="outline-container-orge69f606" class="outline-4">
<h4 id="orge69f606"><span class="section-number-4">1.2.1.</span> Exercises</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Use the Factorization method to find the solution to the following quadratic equations: <br />
</p>
<ul class="org-ul">
<li>\(x^2 - 10x + 21=0\) solution \({x =3, x=7}\) <br /></li>
<li>\(2x^2 + 5x - 12 = 0\) solution \({x=3/2, x=-4}\) <br /></li>
<li>\(x^2 - 3x - 10 = 0\) solution \({x=5, x=-2}\) <br /></li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org51236f1" class="outline-2">
<h2 id="org51236f1"><span class="section-number-2">2.</span> Completing of Squares</h2>
<div class="outline-text-2" id="text-2">
<p>
"Completing of Squares" is another method of solving quadratic equations. It is rarely used in solving quadratic equation. <br />
However, one ought to be equipped with this knowledge, just in case, your teacher asks you to apply only this method. Apply the <br />
following steps in solving with the completing of squares method. <br />
</p>

<p>
Consider the general form of the quadratic equation: \(ax^2 + bx + c=0\) <br />
Then: <br />
</p>
<ul class="org-ul">
<li>Divide the entire equation by a so that the coefficient of \(x^2\) is 1 <br />
\(x^2 + (b/a)x + c/a = 0\) <br /></li>
<li>Multiply the coefficient of the middle term by half (1/2), square and subtract the result from itself <br />
\(x^2 + (b/a)x + (b/2a)^2 - (b/2a)^2 + c/a = 0\) <br />
Note: The equation remains the same, we just added 0 (i.e the result of the third and fourth terms above) <br /></li>
<li>Group the first and third term together without their squares <br />
\((x + (b/2a))^2 - (b/2a)^2 + c/a = 0\) <br />
Note: When we expand the first bracket, we always get the result of the step above <br /></li>
<li>Rearranging the equation <br />
\((x + (b/2a))^2 = (b/2a)^2 - c/a\) <br /></li>
<li>Solving the Right Hand Side of the equation, we get  <br />
\((x + (b/2a))^2 = b^2/4a^2 - c/a\) <br />
\((x + (b/2a))^2 = (b^2 - 4ac)/4a^2\) <br /></li>
<li>Square root both sides to get <br />
\((x + (b/2a)) = \sqrt((b^2 - 4ac)/4a^2)\) <br />
Note: the square root of a value, yields both a negative and a positive result <br />
\(x = (-b/2a) \pm \sqrt((b^2 - 4ac)/4a^2)\) <br />
\(x = (-b/2a) \pm \sqrt(b^2 - 4ac)/2a\) <br />
\(x = \dfrac{(-b \pm \sqrt(b^2 - 4ac))}{2a}\) <br />
The above equation is referred to as the "Quadratic formula" <br /></li>
</ul>
</div>

<div id="outline-container-orgbbf2154" class="outline-3">
<h3 id="orgbbf2154"><span class="section-number-3">2.1.</span> Example</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Consider the following quadratic equation: \(4x^2 - 5x - 12 = 0\). Use the Completing of
squares method to solve it. <br />
</p>

<p>
\(4x^2 - 5x - 12 = 0\) <br />
\(a= 4, b = -5, c = -12\) <br />
</p>
<ul class="org-ul">
<li>Making the coefficient of x<sup>2</sup> one</li>
</ul>
<p>
\(x^2 + (-5/4)x - 3 = 0\) <br />
</p>
<ul class="org-ul">
<li>Multiplying the coefficient of the middle term by half (1/2), square and subtracting the result from itself</li>
</ul>
<p>
\(x^2 + (-5/4)x + ((1/2)(-5/4))^2 - ((1/2)(-5/4))^2 - 3 = 0\) <br />
\(x^2 + (-5/4)x + (-5/8)^2 - (-5/8)^2 - 3 = 0\) <br />
</p>
<ul class="org-ul">
<li>Grouping the first and third term together without their squares</li>
</ul>
<p>
\((x + (-5/8))^2 - (-5/8)^2 - 3 = 0\) <br />
</p>
<ul class="org-ul">
<li>Rearranging the equation</li>
</ul>
<p>
\((x + (-5/8))^2 = 3 + (-5/8)^2\) <br />
\((x + (-5/8))^2 = 3 + 25/64\) <br />
\((x + (-5/8))^2 = 217/64\) <br />
</p>
<ul class="org-ul">
<li>Taking the square root on both sides</li>
</ul>
<p>
\((x + (-5/8)) = \sqrt(217/64)\) <br />
\(x = 5/8 \pm \sqrt(217/64)\) <br />
</p>
<ul class="org-ul">
<li>Taking the positive sign "+"</li>
</ul>
<p>
\(x = -1.216\) <br />
</p>
<ul class="org-ul">
<li>Taking the negative sign "-"</li>
</ul>
<p>
\(x = 2.466\) <br />
Therefore our solution(roots) are \(x = {-1.2166, 2.466}\) <br />
</p>
</div>

<div id="outline-container-org4f8da58" class="outline-4">
<h4 id="org4f8da58"><span class="section-number-4">2.1.1.</span> Exercises</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Refer to the exercises above and use the completing of squares method to solve them <br />
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orga047b3f" class="outline-2">
<h2 id="orga047b3f"><span class="section-number-2">3.</span> Quadratic Formula</h2>
<div class="outline-text-2" id="text-3">
<p>
Quadratic Formula is one of the most common method for solving a quadratic equation especially when 
the coefficients are in decimals and factors are not easily found to use the factorization approach.
We use the following formula to solve a quadratic equation. <br />
</p>

<p>
\(x = (-b \pm \sqrt(b^2 - 4ac))/2a\) <br />
This formula is known as the Quadratic Formula or the Almighty Formula (Do not ask me why)
We simply apply the formula to find the solution or roots of the quadratic equation <br />
</p>
</div>

<div id="outline-container-org80d69d1" class="outline-3">
<h3 id="org80d69d1"><span class="section-number-3">3.1.</span> Example</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Consider the following quadratic equation \(3x^2 - 5x + 2 = 0\) <br />
</p>

<p>
We first note the coefficients, \(a = 3, b = -5, c = 2\) <br />
Then we substitute them into the formula <br />
\(x = \dfrac{(-(-5) \pm \sqrt((-5)^2 - 4(3)(2)))}{2(3)}\) <br />
\(x = (5 \pm \sqrt(25 - 24))/6\) <br />
\(x = (5 \pm \sqrt(1))/6 = (5 \pm 1)/6\) <br />
Taking the positive sign <br />
\(x = (5 + 1)/6 = 1\) <br />
Taking the negative sign <br />
\(x = (5 - 1)/6 = 2/3\) <br />
Therefore the roots of the quadratic equation are {1, 2/3} <br />
</p>
</div>

<div id="outline-container-org9330500" class="outline-4">
<h4 id="org9330500"><span class="section-number-4">3.1.1.</span> Exercise</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Refer to the exercises above and use the quadratic formula to solve them. <br />
</p>

<p>
Hopefully this short article has been helpful. <br />
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 30/07/2024</p>
<p class="author">Author: Rawley Amankwah</p>
<p class="date">Created: 2024-07-30 Tue 18:55</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
